'*******************************************************************************
' Подсистема:	Редактор/Мастер Профиля пользовтеля (персональные настройки)
' Назначение:	
'*******************************************************************************
Option Explicit

'==============================================================================
' Обработчик события загрузки первой страницы мастера / редактора
Sub usrXEditor_OnPageStart(oSender, oEventArgs)
	' Инициализация PE задания периодов времени
	InitPeriodSelector(oSender)
End Sub
