'*******************************************************************************
' Подсистема:	ARMS - Alligator Resource Management System 
' 				( Учебный курс - CROC XML Framework .NET )
' Назначение:	Пример подключаемого скрипта редактора, "подменяющего"
'				текст стандартной кнопки
'*******************************************************************************
Option Explicit

' Регистрируем ДОБАВОЧНЫЙ обработчик системного события загрузки HTML-окна:
Call window.attachEvent( "onload", GetRef("Initialize") )

Sub Initialize()
	' HTML-представление диалога редактора (но не страниц редактора!) на данный 
	' момент сформировано и доступно через HTML DOM: подменяем текст кнопки
	'cmdCancel.InnerText = "Применить"
End Sub 